Tekla Open API Reference for Tekla Structures 2025
Object Properties
The Object type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the object.
Top
See Also
Reference
Object Class
Tekla.Structures.Model Namespace